/*
a = "ab[cd]ef[ghk]ilmn"
a.match(/\[[^\[\]]*\]/g)
[cd],[ghk]
"[cd]".match(/\w/g)
c,d
//
a = "abe?"
a.match(/(\w)(\?)/)
e?,e,?
*/

//var hashdata;
/*var hashloading=false;
var hashTimerID=0;
var hashAjax;
function onHashTimer(){
	if(!hashloading){
		hashloading=true;
		var params=new Object();
		params["noheader"]=true;
		SendAjax(5,params,onData,"","data/hashdata.txt",hashAjax);
	}
};
onHashTimer();

function onData(_res, result, _dat, params){
	if(_res == "OK"){
		hashloading = false;
		hashdata = _dat.data;
		shContent();
		clearTimeout(hashTimerID);
		hashTimerID = setTimeout("onHashTimer()", 1000*60*60);
	}
};

var rawloading=false;
var rawTimerID=0;
var rawdata;
var rawAjax;
function onRawTimer(){
	if(!rawloading){
		rawloading=true;
		var params=new Object();
		params["noheader"]=true;
		SendAjax(5,params,onRawData,"","data/rawdata.txt",rawAjax);
	}
};
onRawTimer();

function onRawData(_res, result, _dat, params){
	if(_res == "OK"){
		rawloading = false;
		rawdata = _dat;
		clearTimeout(rawTimerID);
		rawTimerID = setTimeout("onRawTimer()", 1000*60*60);
	}
};
*/

var langMap = {
	/*jp:{
		parabreak : "\r\n"
		, sentbreak: {
			val:["\\n","。"]
		}
		, clausebreak: {
			val:[ "そして" ]
		}
		,phraseBreak:{
			right:["(.*)(といったら(ありはし)*ない|なかった)","(.*{aka}|[せし])((?:ずに|ないで)はすまない)","(.*でなくてなん(?:だ|であ)ろう)","(.*とい(?:う|った)ところだ)","(.*では|じゃ)(あるまいし)","(あなた|きみ|あいつ)","(.*をものともせずに)","(.*もさるこのながら)","(.*ないものでもない)","(.*ないではおかない)","(.*て)(からというもの)","(.*{uku}|の)(きらいがある)","(ただ)(.*)(のみならず)","(.*を皮切り[にと]して)","(.*に[は]?あたらない)","(.*ともな(?:ると|れば))","(.*ずにはおかない)","(.*があるからこそ)","(.*[とに]したところで)","({oko}うにも)(.*{eke}{nai})","(.*を禁じえない)","(.*め(?:く|いて|いた))","(.*まで(?:のこと)*だ)","(.*ばそれまでだ)","(.*にかたくない)","(.*にかかわらず)","(.*ともな(?:く|しに))","(.*といい)(.*といい)","(.*{uku}|た)(そばから)","(.*んばかり[だにの])","(.*ん)(がため[のに])","(.*をよぎなく)","(.*べからざる)","(.*にもまして)","(.*にひきかえ)","(.*にかかわる)","(.*なくして[は]?)","(.*ないまでも)","(.*とばかりに)","(.*と思いきや)","(.*といっても)","(.*といえども)","(.*と相まって)","(.*てやまない)","(.*だけでなく)","(.*たいへん(?:だ))","(.*た)(ところで)","(.*このなしに)","(.*[とに]したって)","(.*[で]?(?:さえ|すら))","(はしから)","(なかなか)","(とても(?:だ))","(とすぐに)","(かどうか)","({uku}まい(?:[がと]))","({iki}やすい)","({iki}にくい)","({eke}た)(とき)","(.*をよそに)","(.*をもって)","(.*をもって)","(.*を問わず)","(.*を限りに)","(.*をおいて)","(.*もらった)","(.*までも{nai})","(.*べからず)","(.*ばかりに)","(.*はおろか)","(.*によらず)","(.*にたえる)","(.*にたえ{nai})","(.*に即して)","(.*に即した)","(.*に至って)","(.*にあって)","(.*なり)(.*なり)","(.*ならでは)","(.*なしに[は]?)","(.*なしでは)","(.*ながらも)","(.*ながらに)","(.*ないでは)","(.*とはいえ)","(.*ところを)","(.*ときたら)","(.*とあれば)","(.*とあって)","(.*たりとも)","(.*だけでも)","(.*しまつだ)","(.*し?ないで)","(.*こととて)","(.*けれども)","(.*きわめて)","(.*きわまる)","(.*きわまり)","(.*からある)","(.*が早いか)","(.*かたわら)","(.*かたがた)","(.*かぎり(?:だ))","(.*いかにも)","(.*あっての)","(.*{iki}つ)(.*{eke}つ)","(.*)(っぱなし)","(.*)(おかげで)","(付け(?![たるて]))","(付き(?![ま]))","(もっと)","(には[^く])","(なので)","(とても)","(として)","(でした)","(できる)","(て)(いる)","(て)(い{nai})","(ついて)","(だった)","(ぐらい)","(かなり)","(ある)(?![い])","({iki})(たい)","({ei}たら)","([ん][でだ][^す])","([^に]も[^ちた])","(.*ゆえ[にの])","(.*や否や)","(.*ものを)","(.*もある)","(.*まみれ)","(.*までで)","(.*まじき)","(.*ばこそ)","(.*ばかり)","(.*の極み)","(.*の至り)","(.*に足る)","(.*にして)","(.*に至る)","(.*なり[にの])","(.*なり[^にの])","(.*とは[ね])","(.*である)","(.*ずくめ)","(.*ごと[きく])","(.*くれた)","(.*からの)","(.*がてら)","(.*が最後)","(.*いかん)","(.*あげた)","(.*{iki}(?:[よ]う))","(.*[だか]ろう)","(付き)","(より)","(や(?!っ))","(もう)","(ほぼ)","(ので)","(に[^よも])","(と(?![うて]))","(で[^きはす])","(ため)","(ただ)","(だけ)","(する)","(して)","(こと)","(こそ)","(から)","(が(?![てりるっ]))","({eke}る)","({ei}た$)","({ei}(?:[て]))","(.*べく)","(.*でも)","(.*たる)","(.*だに)","(.*しい)","(.*)(です)","(.*)({eke}ば)","(.*(?:する))","(へ)","(は)","({nai})","(.*[くすつぬふむる])"]
			, both:["(かどうか)","(つつある)","(ように)","(という)","(であれ)","(まで)","(など)","(上げ[^て])","(下げ[^て])","(のみ)","(＆)","(を)","([０-９]+)","(\\d+)","([Ａ-Ｚａ-ｚ]+)","(\\s +)","([・」「、）（　“”。])","([ァ-ヾ]+)","(\\w+)","([がのにへとでな])(?![ぁ-ゞ])","({me})"]
		}
		,charBreak:{
			val:[""]
		}
		, pattern:{
			"{nai}":"(?:ない|なく|ません|なかった|ませんでした)","{me}":"私|僕|俺","{oko}":"[おこごそとのほもろよ]","{ei}":"[えけげせねへめれっいきぎしちにひみり]","{eke}":"[えけげせてねへめれ]","{uku}":"[うくぐすつぬふむる]","{iki}":"[いきぎしちにひみり]","{aka}":"[あかがさたなはまやらわ]"
		}
		, grammer:{
			val:["(.*)(です$)","(.*)(は$)"]
			, attr:["({_objstr:$1,phyitthi:true})","({_sbjstr:$1,thee:true})"]
		}
		, splitter:"\u09ff\u09ff\u09ff"
	}
	, */
	mm:{
	
	
	
	/////////////
	
	
	
	, sentbreak: {
			val:["\\n","။","(\\\\?+)"]
			//, ac:{"္+":"္","\ +":" ","္([်,ၽ])":"$1္","([ျၾ])([ြ])([က-အႏ])":"$1$3$2"," ([့,႔,႕])":"$1","၊္":"္၊","([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅ])":"$2$1","([ု,ူ,ႈ,ႉ,ဳ,ဴ])([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])":"$2$1","([့,႔,႕])္":"္$1","္([ြ,ႊ])":"$1္","([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([ွ,ႇြ,ႊ])":"$2$1","([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([်,ၽ])":"$2$1","([်,ၽ])([ြ,ႊ])":"$2$1","([ေ,ၾ,ျႄ])၀":"$1ဝ","၀([က-ူဲ-ွၚ-ၽႅ-႗])":"ဝ$1"}
		}
		
		
		
/* multiply_sets - imported from Aung Kyaw Htet's python codes */
/*
function multiply_sets(input_sets){
	var result_in = input_sets[0];
	var current_input = input_sets[1];
	var result_out = []; 
	for (var j =0; j < result_in.length; j++ ){
		for (var i = 0 ; i < current_input.length ; i++ ){
			result_out[result_out.length] = result_in[j]  + '\u200B' + current_input[i];
		}
	}
   if( input_sets.length > 2){
			input_sets.splice(1,1);
			input_sets[0]=result_out;
			return multiply_sets(input_sets);
	}
	return result_out;
}
*/
// multiply_sets end

//var zx=multiply_sets([["စား","လုပ္"],["ခဲ့","နိုင္","ခ်င္","ခြင့္ရ","လို့ရ","ေန","ဆဲ"],["လွ","ေကာင္း"],["လွ","ေကာင္း"],["ေသာ"],["စြာ"],["သည္","တယ္"],["ရွင္","(ခင္)?ဗ်ာ"]]);
//var zx = multiply_sets([['a','b','c'], ['1','2','3', '4'], ['G', 'H']]);


	/*var re; var results=[]; var tmp;
	str = "(.*)(:N-x:)(.*)(:V-ji:)(:V-x:)";
	eval('re = new RegExp(":(.*?):","g")');
	while(tmp = re.exec(a)){
		results[results.length]=tmp[0];
	}*/
	
		//"([\u1023-\u102A\u104A-\u104F])":"\u200B$1", //put \u200B
		//"([က-အ])(?!\u103A)":"\u200B$1", //put \u200B
		//"\u1039\u200B":"\u1039", //put \u200B
		//မီးသၿဂႋဳဟ္-,သကၤႆနဂုိရ္ျပည္, သႀကၤန္, သခၤ်ဳိင္းကုန္း, သဂၤါယနာ, သၿဂဳႋဟ္က်မ္း မဂၤ သခ်ၤာ သေဘၤာ


/*
function bSort(str1,str2){ 
	var ret =0;
	var a=str1.bnormalize().bsplit();
	var b=str2.bnormalize().bsplit();
	var _len = a.length>b.length?b.length:a.length;
	for(var i1=0;i1<_len;i1++){
		if(a[i1]!=b[i1]){
			var _aval=_gv(a[i1]);
			var _bval=_gv(b[i1]);
			ret = (_aval==0 && trim(a[i1])!=""?10000000:_aval) - (_bval==0 && trim(b[i1])!=""?10000000:_bval);
			break;
		}else if(i1==_len-1 && a.length<b.length){
			ret = 1;
		}
	}
	return ret; 
};
*/

function optionGen(id,from,to,label,index,arry,_inner,option,digit){
	var isObj=false;
	var start=from;
	var str="<select id='"+ id +"' name='"+ id +"' "+(option?option:"")+">";
	if(typeof(from)=="object"){
		isObj=true;start=0;to=from.length-1;
	}
	for(var i=start;i<=to;i++){
		str +="<option value='"+(isObj?from[i]:(((digit&&i<10)?"0":"")+i))+"'"+(index?((isObj?from[i]:i)==index?" selected":""):"")+">"+((arry!=null && arry[i])?arry[i]:i)+label +"</option>";
	};
	str+="</select>";
	if(_inner!=null){
		if(_inner=="id"){
			_id("span"+id)._innerHTML=str;
		}else if(_inner=="iddiv"){
			_id("div"+id)._innerHTML=str;
		}else{
			_id(_inner)._innerHTML=str;
		}
	};
	return str;
}
function getChar(i){
	if(i<10){
		i=48+i;
	}else{
		i=i+55;
	}
	var ch=String.fromCharCode(i);
	return ch;
}
function getrid(){
	var str="";
	for(var i=0;i<32;i++){
		str +=getChar(Math.random()*36);
	}
	return str;
}

// "\\^$*+?{}[]().:!=|-,/"
//	for(var i=0;i < this.length;i++){
//		if([!"#$%&'()*+,-./:;?@[\\\]_`{|}~] "\\^$*+?{}[]().:!=|-,/".indexOf(this.charAt(i))!=-1){
//			ret +="\\"+this.charAt(i);
//		}else{
//			ret +=this.charAt(i);
//		}
//	}
//	return ret;



/*
function _getCacheData(obj, query, data){
	var found = false;
	var itemCount = 0;
	var qtmp = query.addSlash();
	var isBur = _o[_o.x]["isburmese"]?1:0;

	var re = eval("/^"+qtmp+"/"); //startwith

	for( var i = _bcx[qtmp.charAt(0)]-1 ; i < _bcx[qtmp.charAt(0)]+5000; i++ ) {
		if(isDef(_bc[i][2])){
			if(_bc[i][2]=="$"){
				re = eval("/^"+qtmp+_bc[i][2]+"/");
			}
		}
		if(re.test(_bc[i][isBur])){
			if( itemCount < 30) {
				data[itemCount] = _bc[i];
				_o[_o.x]["list"][itemCount] = eval( _bc[i] ) ;
				itemCount++;
			} else{
				_o[_o.x]["prev"] = query;
				break;
			}
			found = true;
		}//else if(found) { break; }
		if( itemCount > 30 ) break;
	}
	return data;
}
*/

	//get from spelling
	//if(_o[_o.x]["_cache"]){
	    //data = _getCacheData (obj, query,data);
	//}else{
	    data = _getMenuEx(obj, query, data);
	    data = _getMenuExUpd(obj, query, data);
	//}


function q_sort(L, left, right){
	var l_hold = left;
	var r_hold = right;
	var pivot = L[left];

	while (left < right) {
		while ((L[right]>=pivot) && (left<right)) {
			right--;
		}
		if (left != right){
			L[left] = L[right];
			left++;
		}
		while ((L[left]<=pivot) && (left<right)) {
			left++;
		}
		if (left != right) {
			L[right] = L[left];
			right--;
		}
	}
	
	L[left] = pivot;
	pivot = left;
	left = l_hold;
	right = r_hold;
	
	if (left < pivot) q_sort(L, left, pivot-1);
	if (right > pivot) q_sort(L, pivot+1, right);
}

function quickSort(L){
	q_sort(L, 0, L.length - 1);
}


/*
	if(_o[_o.x].y["dlen"]==0 && ( data.length==0)  && (_o[_o.x].y['prevW0'] !='') && (_o[_o.x].y['step'] == 1) && (_o[_o.x].y["prev0"].length < query.length) ) {
		var ret = _o[_o.x]["count"]==0;
		_o[_o.x]["update"] = true;
		_onMDown_(obj);
		_o[_o.x]["query"] = query.substr(query.length-1,1);
		_o[_o.x].y =new Object();
		return;
	}else if(data.length>0 ){
		_o[_o.x].y = new Object();
		_o[_o.x].y["prev0"] = query;
		_o[_o.x].y["dlen"] = dlen;
		_o[_o.x].y['prevW0'] = data[0][1];
		_o[_o.x].y['step'] = 1;
		_o[_o.x]["update"] = false;
	}*/
	
	
//var div = document.createElement('div');
//div.innerHTML = '<span class="inline" id="'+_g.id+'drop"'+'>'+'</span>';
//document.getElementsByTagName("body")[0].appendChild(div);
//_parNode.appendChild(div);

/*
function bbac(str){
	var ret=str;
	for(var l=0; l<_b.a.length; l++){
		 var _r2 = eval( "/" + _b.a[l].m +"/");
		 if( _r2.test ( ret ) ){
			 for( var y in _b.a[l].r ){
				_r2 = eval( "/" + y  +"/");
				ret = ret.replace( _r2  , _b.a[l].r[y] );
			 }
		 }
	}
	return ret;
}

;String.prototype.bbac=function(){
	return bbac(this);
}
*/

/*		"([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([ွ,ႇြ,ႊ])":"$2$1",
		"္+":"္",
		"([့,႔,႕])":"$1",
		"၊္":"္၊",
		"([ေ,ၾ,ျႄ])၀":"$1ဝ",
		"([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅ])":"$2$1",
		"([ု,ူ,ႈ,ႉ,ဳ,ဴ])([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])":"$2$1",
		"([ျၾ])([ြ])([က-အႏ])":"$1$3$2",
		"([်,ၽ])([ြ,ႊ])":"$2$1",
		"%%+":"","္([်,ၽ])":"$1္",
		"၀([က-ူဲ-ွၚ-ၽႅ-႗])":"ဝ$1",
		"္([ြ,ႊ])":"$1္",
		"([ံ,ိ,ႎ,ီ,ဲ,ႌ,ၤ])([်,ၽ])":"$2$1",
		"ေ ":"ေ"," ာ":"ာ",
		"်ၤ":"ၤ်", 
		'([ခဂငဒပဝ])ာ':'$1ါ',
		'([ၾျ][ခဂငဒပဝ])ါ':'$1ာ',
		'ျ([ကဃဆဏတထဘယလသဟ])':'ၾ$1',
		'ည(ာဏ)':'ၠဉ$1',
		'([ု,ူ])့':'$1႔','(န.?)့':'$1႔',
		'ွ(.?)ု':'$1ႈ',
		"([ဍဋညျၾ].{1,2})ု":"$1ဳ","([ဍဋညျၾ].{1,2})ူ":"$1ဴ",
		//"([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅွြႊည႒ဠစ် ်][ံိႎဲ]?)ု":"$1ဳ","([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅွြႊည႒ဠ ်][ံိႎဲ]?)ူ":"$1ဴ",
		"န([ံိႎဲ]?[ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅႇွုူႈႉြႊ])":"ႏ$1",
		"ွ([ိႎ်ဲၽ]?)ွ":"ွ$1","ြွ|ွြ|ႊွ":"ႊ","(်ြ|ြ်)":"ြၽ","[ွႇ]([ိီ်ၽ]?)ြ":"ႊ$1","်ွ":"ွ်","([ျၾ].{0,2})ွ":"$1ႇ","([ဝြႊ].{0,2})ြ":"$1",
		"([ဥ])[ုဳ]":"$1","ၤ(.{0,2})ိ":"ႋ$1","ၤ(.{0,2})ီ":"ႌ$1","ာ႕":"ာ့",
		"ၾ([ကဃဆဏတထဘယလသဟ][ံိႎဲ]?ြ)":"ႂ$1",
		"ါ္":"ၚ","([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅႇွုူႈႉြႊန်ဳဴ].?)[့႔]":"$1႕"
		*/
		
		
/*
//for test loading , not using now
var rawloading=false;
var rawTimerID=0;
var sobj;
var rawAjax;
function onRawTimer(){
	if(!rawloading){
		rawloading=true;
		var params=new Object();
		SendAjax(5,params,onRawData,"","data/mortho.txt",rawAjax);
		//SendAjax(5,params,onRawData,"","data/autosuggest.txt",rawAjax);
	}
};
//onRawTimer();

function onRawData(_res, result, _dat, params){
	if(_res == "OK"){
		rawloading = false;
		sobj = _dat;
		clearTimeout(rawTimerID);
		rawTimerID = setTimeout("onRawTimer()", 1000*60*60);
	}
};

function _getRawData(obj){
	if(!sobj) return false;
	var query=_o[_o.x]["query"];
	var ret = sobj.match(eval("/(?:\,)("+query+"[^\,]*?)(?:\,)/g"));if(!ret) return false;
	ret = ret.join("").replace(/\,(?!\,)/g,"").split(/\,+/).slice(0,9);
	if(ret.length>0){ 
		_o[_o.x]["list"]=ret;
		_o[_o.x]["count"]=ret.length;
		_showMenu( obj, query, ret );
	}else{
		_o[_o.x]["list"]=[];
		_o[_o.x]["count"]=0;
		_o[_o.x]["query"]="";
		_hide( _o.x + "drop" );
	}
	return ret;
};
*/

	"ac3":{
	/*    	"(ႏ)":"န","([၀])":"ဝ","(႐)":"ရ",	"(န္ုပ္)":"န္နုပ္", 
	    	"([ဉၫ])":"ည",
			"([ၱ])":"ၲ", 
			"([ဳ])":"ု","([ဴ])":"ူ","([ါ])":"ာ","([ႇ])":"ွ","([ၽ])":"်","([ႊ])":"ွြ","([႔,႕])":"့","([ႈ])":"ွု","([ႉ])":"ွူ",
			"([ၾ,ႀ,ႂ,ႄ,ၿ,ႁ,ႃ])":"ျ",
			"([ႎ])":"ိံ","([ႍ])":"ၤံ","([ႋ])":"ိံ","([ႌ])":"ီံ",
			"([ၚ])":"ာ္",
			"(ိွ)":"ွိ"*/
	},

function openDialog(_s,w,h,strName){
	window.open(_s,strName?strName:'_blank','toolbar=no,location=no,directories=no,status=no,menubar=no,scrollbars=no,resizable=no,width='+(!w?420:w)+',height='+(!h?300:h));
}
function FlashObject(id,width,height,path,flashvars,transparent,scale){
	var html='<object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=6,0,40,0" width="'+width+'" height="'+height+'" id="'+id+'" >'+'<param name=movie value="'+path+'" />'+ '<param name=quality value="high" />'+ '<param name=play value="true" />'+ '<param name=bgcolor value="#ffffff" />'+(transparent?'<param name="wmode" value="transparent" />':'')+(!scale?'<param name="scale" value="noscale" />':'')+'<param name="FlashVars" value="'+flashvars +'" />'+ '<embed src="'+path+'" FlashVars="'+flashvars+'" menu="false" '+(scale?'scale="noscale" ':'')+(transparent?'wmode="transparent"':'')+' quality=high bgcolor=#ffffff width="'+width+'" height="'+height+'" name="'+id+'" align="" type="application/x-shockwave-flash" pluginspage="https://www.macromedia.com/go/getflashplayer" />'+'</object>';
	return html;
}
function getOS(){
	if(navigator.userAgent.indexOf("Windows")!=-1){
		return "Windows";
	}else if(navigator.userAgent.indexOf("Macintosh")!=-1){
		return "Mac";
	}
	return;
};


// CSS setting
// We define styling hardcoded instead of css styling, so that user do not need to added our
// component styling.
//var class_tips = ' style="background-color: #00FFCC; padding:1px; border: #87CEFA solid 1px; font:13px/1.6em _FONT_;" ';
//var class_colon = ' style="float:left; background-color: #d7eaf9; padding:1px; min-width:150; border: #87CEFA solid 1px;" ';
//var class_coloff = ' style="float:left; background-color: #e5ecf9; padding:1px; min-width:150; border: #e5ecf9 solid 1px;" ';
//var class_inline = ' style="text-align:left !important; float:left !important; position:absolute !important; background-color: #e5ecf9;' +
	'min-width:150;width:50%; max-height:450; min-height:20; overflow:hidden; padding:3px; visibility:hidden; cursor:pointer;' +
	'font:13px/1.6em _FONT_; z-index:100;" ';
//var class_on = ' style="background-color:#87CEFA; min-width:150;" ';
//var class_off = ' style="background-color:#e5ecf9; min-width:150;" ';

/* char list is corrupted with this, so temporarily disabling this */
//var class_bchlist = ' style="float:left; padding:1px 8px 1px 8px; margin:1px 4px 1px 4px; background-color: #101010; color:Yellow;' +
//	'font:15px/1.8em Zawgyi-One,Arial,Verdana,Sans-Serif; cursor:pointer; width:90%;display:none;" ';

/* // what is this???
function getClassOnOff(className)
{
    if (className == 'burglish_on') return class_on;
    else if (className == 'burglish_colon') return class_colon;
    else if (className == 'burglish_coloff') return class_coloff;
    else return class_off;
}*/

function isEmail(str){
	return /^([\w-]+(?:\.[\w-]+)*)@((?:[\w-]+\.)*\w[\w-]{0,66})\.([a-z]{2,6}(?:\.[a-z]{2})?)$/i.test(str);
}
function CInt(str){
	try{var i1=parseInt(str);
		return i1;
	}catch(exp){
		return false;
	}
}

function cutStr(str,l){
	var ret=str;
	if(str){
		ret=(str.length >l? str.substr(0,l)+"..." : str);
	}
	return ret;
}

	/*
	// put it values in the object to access reversibly
	for( var j = 0; j < len(_s["val"]); j++ ){
		if(	!isDef( cache[ str( _s["val"][j] ) ] ) ) cache[ str( _s["val"][j] ) ] = j;
	}


	*/
	/*
	// unpack
	for ( var x in _s["ext"] ){
		pak = "";
		for(var x1 in _s["ext"][x]){
			pak += xChar + fillZero( _s["ext"][x][x1] , 3 ); //need to add _offset later :D
		}
		if( srcData.indexOf( unichr( x ) ) != -1 ) {
			eval("re=/"+ unichr(x).addSlash() +"/g");
			srcData = srcData.replace( re, pak );
		}
	}
	
	//main converting process loop start
	for( var i = 0; i < srcData.length; i++ ){
        if(srcData.charAt(i) + srcData.charAt(i+1) == xChar ) {
		    xLen = 5;
	    }
	    if(xLen > 0) {
		    destData += srcData.charAt(i);
		    xLen--;
		    continue;
	    }
		
		converted = false;
		var _char = srcData.charAt(i);
		temp = srcData.charCodeAt(i);

		//if control char, just copy left to right
		if(temp < 33 ) {
			destData += _char;
			continue;
		}

		//for normal character, make a convertion
		if(!converted){
			var _found = false;
			if(_d["ext2"]){
				for(var i1=0;i1<_d["ext2"].length;i1++){
					var ext = _d["ext2"][i1];
					if(eval(ext.m)){
						destData=eval(ext.r);
						//if(ext.f) eval(ext.f);
						_found=true; break;
					}
				}
			}
			if(!_found) {
				if( !isDef( cache[temp] ) ) {
					destData += _char;
				}else{
					if( _d["val"][ cache[temp] ] == 0 )	{
						destData += xChar + fillZero( cache[temp] , 3 );
					}else{
						destData += unichr( _d["val"][ cache[temp] ] );
					}
				}
			}
		}
	}
	//main converting process loop end

	//repack ext
	for ( var x in _d["ext"] ){
		if(_d["ext"][x].length>1){ //only on demand
			pak="";var pak2="";
			for(var x1 in _d["ext"][x]){
				var zeroFilled = fillZero( _d["ext"][x][x1] , 3 );
				pak += xChar + zeroFilled;
				pak2 += unichr( _d["val"][ _d["ext"][x][x1] ] );
			}
			if( pak && destData.indexOf( pak ) != -1 ) {
				eval("re=/"+ pak.addSlash() +"/g");
				destData = destData.replace( re, unichr( x ) );
			}
			if( pak2 && destData.indexOf( pak2 ) != -1 ) {
				eval("re=/"+ pak2.addSlash() +"/g");
				destData = destData.replace( re, unichr( x ) );
			}
		}
	}
		
	//repack val
	for ( var x in _d["val"] ){
		pak = xChar + fillZero( x , 3 );
		if( destData.indexOf( pak ) != -1 && _d["val"][x] != 0 ) {
			re = eval("/"+ pak +"/g");
			if(re.test(destData)){
				destData = destData.replace( re, unichr( _d["val"][x] ) );
			}
		}
	}
	*/
	
	
/*
// Values for each syllable for cache
;var _cachegv={"က":30000,"ကာ":30010,"ကား":30013,"ကိ":30015,"ကီ":30017,"ကု":30020,"ကူ":30022,"ကူး":30025,"ေက":30030,"ကဲ":30040,"ကဲ့":30042,"ေကာ":30045,"ေကာ့":30047,"ေကာ္":30050,"ကံ":30060,"ကံ့":30062,"ကို":30075,"ကိုး":30078,"ကက္":30100,"ကုက္":30120,"ေကာက္":30145,"ကိုက္":30175,"ကင္":30500,"ကင္း":30503,"ေကာင္":30545,"ေကာင္း":30548,"ကိုင္":30575,"ကိုင္း":30578,"ကစ္":30600,"ကိစ္":30615,"ကုဋ္":31120,"ေကာဋ္":31145,"ကဏ္":31500,"ကတ္":31600,"ကိတ္":31615,"ကုတ္":31620,"ကန္":32000,"ကန့္":32002,"ကန္း":32003,"ကိန္":32015,"ကိန္း":32018,"ကုန္":32020,"ကုန္း":32023,"ကပ္":32100,"ကုပ္":32120,"ကုဗ္":32320,"ကမ္":32500,"ကမ္း":32503,"ကုမ္":32520,"ကံု":32581,"ကံုး":32584,"ကယ္":32600,"ကိုယ္":32675,"ကိုယ့္":32677,"ကသ္":33000,"က်":33500,"က်ာ":33510,"က်ား":33513,"က်ိ":33515,"က်ီ":33517,"က်ီး":33520,"က်ူ":33522,"က်ူး":33525,"ေက်":33530,"ေက်း":33533,"က်ဲ":33540,"ေက်ာ":33545,"ေက်ာ့":33547,"ေက်ာ္":33550,"က်ံ":33560,"က်ို":33575,"က်ို့":33577,"က်ိုး":33578,"က်က္":33600,"ေက်ာက္":33645,"က်ိုက္":33675,"က်င္":34000,"က်င့္":34002,"က်င္း":34003,"ေက်ာင္း":34048,"က်ိုင္း":34078,"က်စ္":34100,"က်ဥ္":34410,"က်ဥ္း":34413,"က်ည္":34500,"က်ည္း":34503,"က်တ္":35100,"က်ိတ္":35115,"က်ုတ္":35120,"က်န္":35500,"က်န္း":35503,"က်ိန္":35515,"က်ိန္း":35518,"က်ပ္":35600,"က်ိပ္":35615,"က်ုပ္":35620,"က်မ္း":36003,"က်ံု":36081,"က်ံု့":36083,"က်ံုး":36084,"က်ယ္":36100,"ျက":37000,"ျကာ":37010,"ျကား":37013,"ျကိ":37015,"ျကီး":37020,"ျကူ":37022,"ျကူး":37025,"ေျက":37030,"ေျကး":37033,"ျကဲ":37040,"ေျကာ":37045,"ေျကာ့":37047,"ေျကာ္":37050,"ျကံ":37060,"ျကံ့":37062,"ျကို":37075,"ျကို့":37077,"ျကိုး":37078,"ျကက္":37100,"ေျကာက္":37145,"ျကိုက္":37175,"ျကင္":37500,"ေျကာင္":37545,"ေျကာင့္":37547,"ေျကာင္း":37548,"ျကိုင္":37575,"ျကစ္":37600,"ျကဥ္":37910,"ျကဥ္း":37913,"ျကည္":38000,"ျကည့္":38002,"ျကည္း":38003,"ျကတ္":38600,"ျကိတ္":38615,"ျကုတ္":38620,"ျကန္":39000,"ျကန့္":39002,"ျကပ္":39100,"ျကမ္":39500,"ျကမ္း":39503,"ျကိမ္":39515,"ျကိမ္း":39518,"ျကံု":39581,"ျကံုး":39584,"ျကယ္":39600,"ကြာ":40510,"ကြီ":40517,"ေကြ့":40532,"ေကြး":40533,"ကြဲ":40540,"ကြက္":40600,"ကြင္း":41003,"ကြတ္":42100,"ကြန္":42500,"ကြန့္":42502,"ကြန္း":42503,"ကြပ္":42600,"ကြမ္":43000,"ကြမ္း":43003,"ကြယ္":43100,"ကြ်":44000,"ေကြ်း":44033,"ကြ်ဲ":44040,"ကြ်ံ":44060,"ကြ်က္":44100,"ကြ်တ္":45600,"ကြ်န္":46000,"ကြ်န္း":46003,"ကြ်မ္း":46503,"ျကြ":47500,"ျကြား":47513,"ေျကြ":47530,"ေျကြ့":47532,"ေျကြး":47533,"ျကြက္":47600,"ျကြင္း":48003,"ျကြပ္":49600,"ျကြယ္":50100,"ခ":60000,"ခာ":60010,"ခား":60013,"ခု":60020,"ခူ":60022,"ခူး":60025,"ခဲ":60040,"ေခာ":60045,"ေခာ္":60050,"ခံ":60060,"ခံ့":60062,"ခို":60075,"ခိုး":60078,"ခက္":60100,"ေခာက္":60145,"ခိုက္":60175,"ခင္":60500,"ခင္း":60503,"ေခာင္":60545,"ေခာင့္":60547,"ေခာင္း":60548,"ခိုင္":60575,"ခိုင္း":60578,"ခတ္":61600,"ခုတ္":61620,"ေခတ္":61630,"ခန္":62000,"ခန့္":62002,"ခန္း":62003,"ခုန္":62020,"ခပ္":62100,"ခုပ္":62120,"ခမ္း":62503,"ခံု":62581,"ခံုး":62584,"ခ်":63500,"ခ်ာ":63510,"ခ်ား":63513,"ခ်ီ":63517,"ခ်ီး":63520,"ခ်ူ":63522,"ေခ်":63530,"ေခ်း":63533,"ခ်ဲ":63540,"ခ်ဲ့":63542,"ေခ်ာ":63545,"ေခ်ာ့":63547,"ေခ်ာ္":63550,"ခ်ို":63575,"ခ်ို့":63577,"ခ်ိုး":63578,"ခ်က္":63600,"ေခ်ာက္":63645,"ခ်င္":64000,"ခ်င့္":64002,"ခ်င္း":64003,"ေခ်ာင္":64045,"ေခ်ာင္း":64048,"ခ်ိုင္":64075,"ခ်ိုင့္":64077,"ခ်ိုင္း":64078,"ခ်စ္":64100,"ခ်ဥ္":64410,"ခ်ဥ္း":64413,"ခ်ည္":64500,"ခ်ည့္":64502,"ခ်ည္း":64503,"ခ်ိတ္":65115,"ခ်ုတ္":65120,"ခ်န္":65500,"ခ်ိန္":65515,"ခ်ိန္း":65518,"ခ်ုန္း":65523,"ခ်ပ္":65600,"ခ်ိပ္":65615,"ခ်ုပ္":65620,"ခ်မ္း":66003,"ခ်ိမ့္":66017,"ခ်ံု":66081,"ခ်ံု့":66083,"ခ်ံုး":66084,"ခ်ယ္":66100,"ျခ":67000,"ျခာ":67010,"ျခား":67013,"ျခူး":67025,"ေျခ":67030,"ျခံ":67060,"ျခိုး":67078,"ေျခာက္":67145,"ျခိုက္":67175,"ျခင္":67500,"ျခင္း":67503,"ေျခာင္း":67548,"ျခစ္":67600,"ျခည္":68000,"ျခုတ္":68620,"ျခုပ္":69120,"ျခမ္း":69503,"ျခိမ့္":69517,"ျခိမ္း":69518,"ျခံု":69581,"ျခယ္":69600,"ခြ":70500,"ခြာ":70510,"ေခြ":70530,"ေခြ့":70532,"ေခြး":70533,"ခြဲ":70540,"ခြံ":70560,"ခြံ့":70562,"ခြက္":70600,"ခြင္":71000,"ခြင့္":71002,"ခြင္း":71003,"ခြန္":72500,"ခြန္း":72503,"ခြပ္":72600,"ေခြ်":74030,"ေခြ်း":74033,"ခြ်ဲ":74040,"ခြ်ံ":74060,"ခြ်င္":74500,"ခြ်တ္":75600,"ခြ်န္":76000,"ခြ်န္း":76003,"ျခြ":77500,"ေျခြ":77530,"ျခြင္း":78003,"ျခြမ္း":80003,"ဂ":90000,"ဂာ":90010,"ဂိ":90015,"ဂီ":90017,"ဂု":90020,"ဂူ":90022,"ေဂာ":90045,"ေဂာ္":90050,"ေဂာက္":90145,"ဂိုက္":90175,"ဂိုင္း":90578,"ဂိဇ္":90815,"ဂုဏ္":91520,"ဂိုဏ္း":91578,"ဂန္":92000,"ဂုန္":92020,"ဂံု":92581,"ဂ်ာ":93510,"ဂ်ီ":93517,"ဂ်ူ":93522,"ဂ်ူး":93525,"ေဂ်ာက္":93645,"ဂ်ိုက္":93675,"ဂ်င္":94000,"ဂ်တ္":95100,"ဂ်ုတ္":95120,"ဂ်ပ္":95600,"ဂ်ံု":96081,"ျဂိုဟ္":100175,"ေဂြး":100533,"ဂြမ္း":103003,"ဃ":120000,"ေဃာ":120045,"င":150000,"ငာ":150010,"ငာ့":150012,"ငား":150013,"ငု":150020,"ငံ":150060,"င့":150002,"ငို":150075,"ေငာက္":150145,"ငိုက္":150175,"ေငာင္း":150548,"ငတ္":151600,"ငုတ္":151620,"ငန္":152000,"ငန္း":152003,"ငုပ္":152120,"ငမ္း":152503,"ငံု":152581,"ငံု့":152583,"ငံုး":152584,"ငယ္":152600,"ျငာ":157010,"ျငား":157013,"ျငိ":157015,"ျငီး":157020,"ျငူ":157022,"ျငို":157075,"ျငိုး":157078,"ျငင္း":157503,"ေျငာင့္":157547,"ျငမ္း":159503,"ျငိမ္":159515,"ျငိမ့္":159517,"ျငိမ္း":159518,"ငြား":160513,"ေငြ":160530,"ငွား":150013,"ငွက္":150100,"ျငွိမ္း":159518,"စ":180000,"စာ":180010,"စား":180013,"စိ":180015,"စီ":180017,"စီး":180020,"စု":180020,"စူ":180022,"စူး":180025,"ေစ":180030,"ေစ့":180032,"ေစး":180033,"စဲ":180040,"ေစာ":180045,"ေစာ္":180050,"စံ":180060,"စို":180075,"စို့":180077,"စိုး":180078,"စက္":180100,"ေစာက္":180145,"စိုက္":180175,"စင္":180500,"စင္း":180503,"ေစာင္":180545,"ေစာင့္":180547,"ေစာင္း":180548,"စိုင္":180575,"စိုင္း":180578,"စစ္":180600,"စဥ္":180910,"စဥ့္":180912,"စဥ္း":180913,"စည္":181000,"စည့္":181002,"စည္း":181003,"စဏ္":181500,"စိတ္":181615,"စုတ္":181620,"စန္":182000,"စန့္":182002,"စန္း":182003,"စိန္":182015,"စိန္း":182018,"စုန္":182020,"စုန့္":182022,"စုန္း":182023,"စပ္":182100,"စိပ္":182115,"စုပ္":182120,"စမ္":182500,"စမ္း":182503,"စိမ္":182515,"စိမ့္":182517,"စိမ္း":182518,"စံု":182581,"စံုး":182584,"စြာ":190510,"ေစြ":190530,"ေစြ့":190532,"စြဲ":190540,"စြံ":190560,"စြက္":190600,"စြတ္":192100,"စြန္":192500,"စြန့္":192502,"စြန္း":192503,"စြပ္":192600,"စြမ္း":193003,"စြယ္":193100,"ဆ":210000,"ဆာ":210010,"ဆား":210013,"ဆီ":210017,"ဆီး":210020,"ဆု":210020,"ဆူ":210022,"ဆူး":210025,"ေဆး":210033,"ဆဲ":210040,"ေဆာ":210045,"ေဆာ္":210050,"ဆံ":210060,"ဆံ့":210062,"ဆို":210075,"ဆို့":210077,"ဆိုး":210078,"ဆက္":210100,"ေဆာက္":210145,"ဆိုက္":210175,"ဆင္":210500,"ဆင္း":210503,"ေဆာင္":210545,"ေဆာင့္":210547,"ေဆာင္း":210548,"ဆိုင္":210575,"ဆိုင္း":210578,"ဆည္":211000,"ဆည္း":211003,"ဆဋ္":211100,"ဆတ္":211600,"ဆိတ္":211615,"ဆုတ္":211620,"ဆဒ္":211800,"ဆန္":212000,"ဆန့္":212002,"ဆန္း":212003,"ဆုန္း":212023,"ဆပ္":212100,"ဆိပ္":212115,"ဆုပ္":212120,"ဆမ္း":212503,"ဆိမ့္":212517,"ဆံု":212581,"ဆံုး":212584,"ဆယ္":212600,"ဆယ့္":212602,"ေဆြ":220530,"ေဆြ့":220532,"ေဆြး":220533,"ဆြဲ":220540,"ဆြံ့":220562,"ဆြတ္":222100,"ဆြန့္":222502,"ဆြပ္":222600,"ဆြမ္း":223003,"ဆြယ္":223100,"ဇ":240000,"ဇာ":240010,"ဇိ":240015,"ဇီ":240017,"ဇီး":240020,"ဇူ":240022,"ေဇ":240030,"ေဇာ":240045,"ေဇာ္":240050,"ဇက္":240100,"ေဇာက္":240145,"ဇင္":240500,"ဇင္း":240503,"ေဇာင္း":240548,"ဇာစ္":240610,"ေဇဋ္":241130,"ဇာတ္":241610,"ဇန္":242000,"ဇုန္":242020,"ဇမ္":242500,"ဇိမ္":242515,"ဇယ္":242600,"ဇြဲ":250540,"ဇြတ္":252100,"ဇြန္":252500,"ဇြန္း":252503,"စ်":183500,"စ်ာ":183510,"ေစ်း":183533,"စ်ာန္":185510,"ည":300000,"ညာ":300010,"ညာဥ္":300920,"ညာဏ္":301510,"ညတ္":301600,"ညာသ္":303010,"ည":300000,"ညာ":300010,"ညား":300013,"ညိ":300015,"ညီ":300017,"ညီး":300020,"ညု":300020,"ညဲ":300040,"ညံ":300060,"ညံ့":300062,"ညို":300075,"ညို့":300077,"ညိုး":300078,"ညက္":300100,"ညင္":300500,"ညင္း":300503,"ေညာင္":300545,"ေညာင္း":300548,"ညစ္":300600,"ညဥ့္":300912,"ညည့္":301002,"ညည္း":301003,"ညတ္":301600,"ညိတ္":301615,"ညန္":302000,"ညပ္":302100,"ညြတ္":312100,"ညြန္":312500,"ညြန့္":312502,"ညွာ":300010,"ညွိ":300015,"ညွီ":300017,"ေညွာ္":300050,"ညွို":300075,"ညွို့":300077,"ညွိုး":300078,"ညွက္":300100,"ညွင္း":300503,"ေညွာင့္":300547,"ညွစ္":300600,"ညွဥ္း":300913,"ညွပ္":302100,"ညွြတ္":312100,"ညွြန္":312500,"ညွြန္း":312503,"တ":480000,"တာ":480010,"တား":480013,"တိ":480015,"တီ":480017,"တီး":480020,"တု":480020,"တူ":480022,"တူး":480025,"ေတ":480030,"ေတး":480033,"တဲ":480040,"တဲ့":480042,"ေတာ":480045,"ေတာ္":480050,"တံ":480060,"တံ့":480062,"တို":480075,"တို့":480077,"တိုး":480078,"တက္":480100,"ေတာက္":480145,"တိုက္":480175,"တင္":480500,"တင့္":480502,"တင္း":480503,"ေတာင္":480545,"ေတာင့္":480547,"ေတာင္း":480548,"တိုင္":480575,"တိုင္း":480578,"တစ္":480600,"တည္":481000,"တည့္":481002,"တည္း":481003,"တတ္":481600,"တိတ္":481615,"တုတ္":481620,"တန္":482000,"တန့္":482002,"တန္း":482003,"တိန္":482015,"တိန္း":482018,"တုန္":482020,"တုန္း":482023,"တပ္":482100,"တိပ္":482115,"တုပ္":482120,"တမ္":482500,"တမ္း":482503,"တိမ္":482515,"တိမ္း":482518,"တံု":482581,"တံု့":482583,"တံုး":482584,"တယ္":482600,"တ်ာ":483510,"ျတိ":487015,"ေတြ့":490532,"ေတြး":490533,"တြဲ":490540,"တြက္":490600,"တြင္":491000,"တြတ္":492100,"တြန္":492500,"တြန့္":492502,"တြန္း":492503,"တြပ္":492600,"တြယ္":493100,"ထ":510000,"ထာ":510010,"ထား":510013,"ထိ":510015,"ထီ":510017,"ထီး":510020,"ထု":510020,"ထူ":510022,"ထူး":510025,"ထဲ":510040,"ေထာ":510045,"ေထာ္":510050,"ထံ":510060,"ထို":510075,"ထိုး":510078,"ထက္":510100,"ေထာက္":510145,"ထိုက္":510175,"ထင္":510500,"ထင္း":510503,"ေထာင္":510545,"ေထာင့္":510547,"ေထာင္း":510548,"ထိုင္":510575,"ထိုင္း":510578,"ထစ္":510600,"ထည္":511000,"ထည့္":511002,"ထတ္":511600,"ထိတ္":511615,"ထုတ္":511620,"ထန္":512000,"ထန့္":512002,"ထန္း":512003,"ထိန္":512015,"ထိန့္":512017,"ထိန္း":512018,"ထပ္":512100,"ထိပ္":512115,"ထုပ္":512120,"ထမ္း":512503,"ထိမ္":512515,"ထိမ္း":512518,"ထံု":512581,"ထံု့":512583,"ထံုး":512584,"ထယ္":512600,"ေထရ္":512730,"ထြာ":520510,"ထြား":520513,"ေထြ":520530,"ေထြး":520533,"ထြက္":520600,"ထြင္":521000,"ထြတ္":522100,"ထြန္":522500,"ထြန့္":522502,"ထြန္း":522503,"ဒ":540000,"ဒာ":540010,"ဒိ":540015,"ဒီ":540017,"ဒီး":540020,"ဒု":540020,"ဒူ":540022,"ဒူး":540025,"ေဒ":540030,"ေဒာ":540045,"ေဒာ့":540047,"ေဒာ္":540050,"ဒံ":540060,"ဒိုး":540078,"ဒက္":540100,"ဒုက္":540120,"ေဒာက္":540145,"ဒိုက္":540175,"ဒင္":540500,"ေဒာင္":540545,"ေဒာင့္":540547,"ေဒာင္း":540548,"ဒိုင္":540575,"ဒိုင္း":540578,"ဒိဋ္":541115,"ဒဏ္":541500,"ဒိတ္":541615,"ဒုတ္":541620,"ဒန္":542000,"ဒန့္":542002,"ဒန္း":542003,"ဒိန္":542015,"ဒိန္း":542018,"ဒုန္း":542023,"ဒံု":542581,"ဒံုး":542584,"ဒယ္":542600,"ဒ်န့္":545502,"ျဒ":547000,"ျဒပ္":549100,"ဒြ":550500,"ဒြာ":550510,"ဒြိ":550515,"ေဒြး":550533,"ဒြန္":552500,"ဒြန္း":552503,"ဓ":570000,"ဓာ":570010,"ဓား":570013,"ဓူ":570022,"ဓာတ္":571610,"ဓမ္":572500,"န":600000,"နာ":600010,"နား":600013,"နိ":600015,"နီ":600017,"နီး":600020,"နု":600020,"နူး":600025,"ေန":600030,"ေန့":600032,"နဲ့":600042,"ေနာ":600045,"ေနာ္":600050,"နံ":600060,"နံ့":600062,"နို":600075,"နို့":600077,"နိုး":600078,"နက္":600100,"ေနာက္":600145,"နိဂ္":600315,"နင္":600500,"နင့္":600502,"နင္း":600503,"ေနာင္":600545,"နိုင္":600575,"နိုင္း":600578,"နစ္":600600,"နိစ္":600615,"နည္း":601003,"နိဋ္":601115,"နတ္":601600,"နုတ္":601620,"နန္":602000,"နန့္":602002,"နန္း":602003,"နုန့္":602022,"နုန္း":602023,"နပ္":602100,"နိပ္":602115,"နုပ္":602120,"နိဗ္":602315,"နမ္း":602503,"နိမ္":602515,"နိမ့္":602517,"နံု":602581,"နံု့":602583,"နယ္":602600,"နိသ္":603015,"န်ူ":603522,"နြား":610513,"နြဲ့":610542,"နြံ":610560,"နြမ္း":613003,"နြယ္":613100,"နွ":600000,"နွာ":600010,"နွီး":600020,"ေနွး":600033,"နွဲ":600040,"ေနွာ":600045,"နွံ":600060,"နွံ့":600062,"၌":600176,"နွင္":600500,"နွင္း":600503,"ေနွာင္":600545,"ေနွာင့္":600547,"ေနွာင္း":600548,"နွစ္":600600,"နွတ္":601600,"နွုတ္":601620,"နွန့္":602002,"နွုန္း":602023,"နွပ္":602100,"နွိပ္":602115,"နွမ္း":602503,"နွိမ္":602515,"နွိမ့္":602517,"နွယ္":602600,"နွြာ":610510,"ေနွြး":610533,"နွြံ":610560,"နွြင္":611000,"ဋီ":330017,"ဌ":360000,"ဌာ":360010,"ဌာန္":362010,"ေဌး":360033,"ဍ":390000,"ဎ":420000,"ဏ":450000,"ပ":630000,"ပာ":630010,"ပား":630013,"ပိ":630015,"ပီ":630017,"ပု":630020,"ပူ":630022,"ပူး":630025,"ေပ":630030,"ေပး":630033,"ပဲ":630040,"ပဲ့":630042,"ေပာ":630045,"ေပာ့":630047,"ေပာ္":630050,"ပံ့":630062,"ပို":630075,"ပို့":630077,"ပိုး":630078,"ပက္":630100,"ေပာက္":630145,"ပိုက္":630175,"ပုဂ္":630320,"ပင္":630500,"ပင့္":630502,"ပင္း":630503,"ေပာင္":630545,"ေပာင္း":630548,"ပိုင္":630575,"ပိုင္း":630578,"ပစ္":630600,"ပဇ္":630800,"ပဥ္":630910,"ပည္း":631003,"ပဋ္":631100,"ပာဌ္":631210,"ပဏ္":631500,"ပိဏ္":631515,"ပုဏ္":631520,"ပတ္":631600,"ပိတ္":631615,"ပုတ္":631620,"ပာဒ္":631810,"ပုဒ္":631820,"ပိုဒ္":631875,"ပန္":632000,"ပန္း":632003,"ပိန္":632015,"ပိန္း":632018,"ပုန္":632020,"ပုန္း":632023,"ပပ္":632100,"ပုပ္":632120,"ပုဗ္":632320,"ပိမ့္":632517,"ပံု":632581,"ပံု့":632583,"ပံုး":632584,"ပယ္":632600,"ပိုလ္":632875,"ပိသ္":633015,"ပ်":633500,"ပ်ာ":633510,"ပ်ား":633513,"ပ်ူ":633522,"ေပ်ာ့":633547,"ေပ်ာ္":633550,"ပ်ံ":633560,"ပ်ံ့":633562,"ပ်ို":633575,"ပ်ို့":633577,"ပ်ိုး":633578,"ပ်က္":633600,"ေပ်ာက္":633645,"ပ်င္း":634003,"ေပ်ာင္း":634048,"ပ်စ္":634100,"ပ်ဥ္":634410,"ပ်ဥ္း":634413,"ပ်တ္":635100,"ပ်ပ္":635600,"ပ်မ္း":636003,"ျပ":637000,"ျပာ":637010,"ျပား":637013,"ျပီ":637017,"ျပီး":637020,"ျပု":637020,"ျပူ":637022,"ျပူး":637025,"ေျပ":637030,"ေျပး":637033,"ျပဲ":637040,"ျပဲ့":637042,"ေျပာ":637045,"ေျပာ့":637047,"ျပို":637075,"ျပိုး":637078,"ျပက္":637100,"ေျပာက္":637145,"ျပိုက္":637175,"ျပင္":637500,"ျပင္း":637503,"ေျပာင္":637545,"ေျပာင္း":637548,"ျပိုင္":637575,"ျပိုင္း":637578,"ျပစ္":637600,"ျပည္":638000,"ျပည့္":638002,"ျပဋ္":638100,"ျပတ္":638600,"ျပိတ္":638615,"ျပုတ္":638620,"ျပန္":639000,"ျပန့္":639002,"ျပိန္":639015,"ျပိန္း":639018,"ျပုန္း":639023,"ျပုပ္":639120,"ျပုဗ္":639320,"ျပံု":639581,"ျပံုး":639584,"ျပယ္":639600,"ျပသ္":640000,"ျပိသ္":640015,"ပြ":640500,"ပြား":640513,"ေပြ":640530,"ေပြ့":640532,"ေပြး":640533,"ပြဲ":640540,"ပြဲ့":640542,"ပြက္":640600,"ပြင့္":641002,"ပြတ္":642100,"ပြန္":642500,"ပြန္း":642503,"ပြပ္":642600,"ျပြတ္":649100,"ျပြန္":649500,"ျပြမ္း":650003,"ဖ":660000,"ဖာ":660010,"ဖား":660013,"ဖိ":660015,"ဖီ":660017,"ဖီး":660020,"ဖု":660020,"ဖူ":660022,"ဖူး":660025,"ေဖ":660030,"ေဖး":660033,"ဖဲ":660040,"ဖဲ့":660042,"ေဖာ":660045,"ေဖာ့":660047,"ေဖာ္":660050,"ဖို":660075,"ဖို့":660077,"ဖိုး":660078,"ဖက္":660100,"ေဖာက္":660145,"ဖဂ္":660300,"ဖင္":660500,"ဖင့္":660502,"ေဖာင္":660545,"ေဖာင္း":660548,"ဖိုင္":660575,"ဖိုင့္":660577,"ဖည္":661000,"ေဖာဋ္":661145,"ဖတ္":661600,"ဖိတ္":661615,"ဖုတ္":661620,"ဖန္":662000,"ဖန့္":662002,"ဖိန္း":662018,"ဖုန္":662020,"ဖုန္း":662023,"ဖပ္":662100,"ဖမ္း":662503,"ဖိမ့္":662517,"ဖံု":662581,"ဖံုး":662584,"ဖယ္":662600,"ဖိုလ္":662875,"ဖုသ္":663020,"ဖ်":663500,"ဖ်ာ":663510,"ဖ်ား":663513,"ေဖ်ာ့":663547,"ေဖ်ာ္":663550,"ဖ်ံ":663560,"ဖ်ိုး":663578,"ဖ်က္":663600,"ေဖ်ာက္":663645,"ဖ်င္":664000,"ဖ်င္း":664003,"ေဖ်ာင္း":664048,"ဖ်စ္":664100,"ဖ်ဥ္":664410,"ဖ်ဥ္း":664413,"ဖ်တ္":665100,"ဖ်န္":665500,"ဖ်န္း":665503,"ဖ်ပ္":665600,"ျဖ":667000,"ျဖာ":667010,"ျဖား":667013,"ျဖီး":667020,"ျဖူ":667022,"ျဖူး":667025,"ေျဖ":667030,"ျဖဲ":667040,"ေျဖာ":667045,"ေျဖာ္":667050,"ျဖို":667075,"ျဖိုး":667078,"ေျဖာက္":667145,"ျဖင္":667500,"ျဖင္း":667503,"ေျဖာင္":667545,"ေျဖာင့္":667547,"ေျဖာင္း":667548,"ျဖိုင္":667575,"ျဖစ္":667600,"ျဖည့္":668002,"ျဖည္း":668003,"ျဖတ္":668600,"ျဖုတ္":668620,"ျဖန္":669000,"ျဖန့္":669002,"ျဖန္း":669003,"ျဖုန္း":669023,"ျဖုပ္":669120,"ျဖံု":669581,"ျဖံု့":669583,"ျဖံုး":669584,"ဖြာ":670510,"ဖြား":670513,"ေဖြ":670530,"ေဖြး":670533,"ဖြဲ":670540,"ဖြဲ့":670542,"ဖြံ့":670562,"ဖြင့္":671002,"ဖြတ္":672100,"ဖြပ္":672600,"ဖြယ္":673100,"ဗ":690000,"ဗာ":690010,"ဗား":690013,"ဗိ":690015,"ဗီ":690017,"ဗူ":690022,"ဗူး":690025,"ေဗ":690030,"ေဗာ":690045,"ေဗာ့":690047,"ဗို့":690077,"ေဗာက္":690145,"ဗိုက္":690175,"ဗင္":690500,"ေဗာင္း":690548,"ဗိုင္း":690578,"ဗုဒ္":691820,"ဗန္":692000,"ဗန္း":692003,"ဗိန္":692015,"ဗိန္း":692018,"ဗုန္း":692023,"ဗံု":692581,"ဗံုး":692584,"ဗိုလ္":692875,"ဗိသ္":693015,"ဗ်":693500,"ဗ်ာ":693510,"ဗ်ူ":693522,"ဗ်ိုး":693578,"ဗ်ိုက္":693675,"ဗ်ိုင္း":694078,"ဗ်စ္":694100,"ဗ်ဥ္":694410,"ဗ်ည္း":694503,"ဗ်တ္":695100,"ဗ်ပ္":695600,"ဗ်ုပ္":695620,"ျဗာ":697010,"ျဗူး":697025,"ျဗဲ":697040,"ေျဗာ":697045,"ျဗို့":697077,"ျဗက္":697100,"ေျဗာက္":697145,"ေျဗာင္":697545,"ေျဗာင္း":697548,"ျဗိ":697015,"ျဗတ္":698600,"ျဗုတ္":698620,"ျဗုန္း":699023,"ျဗံုး":699584,"ျဗဟ္":700100,"ျဗာဟ္":700110,"ဗြီ":700517,"ေဗြ":700530,"ဗြက္":700600,"ဗြတ္":702100,"ဗြမ္း":703003,"ဘ":720000,"ဘာ":720010,"ဘား":720013,"ဘိ":720015,"ဘီ":720017,"ဘီး":720020,"ဘု":720020,"ဘူ":720022,"ဘူး":720025,"ေဘ":720030,"ေဘး":720033,"ဘဲ":720040,"ေဘာ":720045,"ေဘာ့":720047,"ေဘာ္":720050,"ဘို့":720077,"ဘိုး":720078,"ဘက္":720100,"ေဘာက္":720145,"ဘင္":720500,"ဘင္း":720503,"ေဘာင္":720545,"ေဘာင္း":720548,"ဘိုင္":720575,"ဘုဥ္း":720933,"ဘဏ္":721500,"ဘတ္":721600,"ဘိတ္":721615,"ဘုတ္":721620,"ဘဒ္":721800,"ဘန္":722000,"ဘန့္":722002,"ဘန္း":722003,"ဘိန္း":722018,"ဘုန္း":722023,"ဘုမ္":722520,"ဘံု":722581,"ဘယ္":722600,"ဘြာ":730510,"ဘြား":730513,"ဘြဲ့":730542,"ဘြင္း":731003,"ဘြိုင္":731075,"ဘြတ္":732100,"မ":750000,"မာ":750010,"မား":750013,"မိ":750015,"မီ":750017,"မီး":750020,"မု":750020,"မူ":750022,"မူး":750025,"ေမ":750030,"ေမ့":750032,"ေမး":750033,"မဲ":750040,"မဲ့":750042,"ေမာ":750045,"ေမာ္":750050,"မံ":750060,"မိုး":750078,"မက္":750100,"မုက္":750120,"ေမာက္":750145,"မိုက္":750175,"မုခ္":750220,"မဂ္":750300,"မင္":750500,"မင္း":750503,"ေမာင္း":750548,"မိုင္း":750578,"မဥ္":750910,"မည္":751000,"မည္း":751003,"မုဋ္":751120,"မဏ္":751500,"မတ္":751600,"မိတ္":751615,"မုတ္":751620,"ေမတ္":751630,"မန္":752000,"မန္း":752003,"မာန္":752010,"မိန္":752015,"မိန့္":752017,"မိန္း":752018,"မုန္":752020,"မုန့္":752022,"မုန္း":752023,"မပ္":752100,"မံု":752581,"မယ္":752600,"မာရ္":752710,"မလ္":752800,"မိလ္":752815,"မိသ္":753015,"မ်ား":753513,"ေမ်ာ":753545,"မ်ို":753575,"မ်ိုး":753578,"မ်က္":753600,"ေမ်ာက္":753645,"မ်ဥ္း":754413,"ျမ":757000,"ျမာ":757010,"ျမား":757013,"ျမီ":757017,"ျမီး":757020,"ျမူ":757022,"ျမူး":757025,"ေျမ":757030,"ေျမ့":757032,"ေျမး":757033,"ျမဲ":757040,"ေျမာ":757045,"ေျမာ့":757047,"ေျမာ္":757050,"ျမို့":757077,"ျမိုး":757078,"ျမက္":757100,"ေျမာက္":757145,"ျမိုက္":757175,"ျမင္":757500,"ျမင့္":757502,"ျမင္း":757503,"ေျမာင္":757545,"ေျမာင္း":757548,"ျမိုင္":757575,"ျမစ္":757600,"ျမည္":758000,"ျမည့္":758002,"ျမည္း":758003,"ျမတ္":758600,"ျမိတ္":758615,"ျမန္":759000,"ျမန္း":759003,"ျမိန္":759015,"ျမိန့္":759017,"ျမုပ္":759120,"ျမံု":759581,"ျမံု့":759583,"မြ":760500,"ေမြ":760530,"ေမြ့":760532,"ေမြး":760533,"မြဲ":760540,"မြတ္":762100,"မြန္":762500,"မြန္း":762503,"မြမ္း":763003,"မွ":750000,"မွာ":750010,"မွား":750013,"မွီ":750017,"မွု":750020,"မွူး":750025,"ေမွး":750033,"မွဲ့":750042,"ေမွာ္":750050,"မွက္":750100,"ေမွာက္":750145,"မွင္":750500,"ေမွာင္":750545,"ေမွာင့္":750547,"မွည့္":751002,"မွတ္":751600,"မွိတ္":751615,"မွုတ္":751620,"မွန္":752000,"မွန္း":752003,"မွိန္":752015,"မွိန္း":752018,"မွုန္":752020,"မွုန့္":752022,"မွုန္း":752023,"ေျမြ":767530,"ျမြက္":767600,"မွ်":753500,"မွ်ား":753513,"ေမွ်ာ":753545,"ေမွ်ာ့":753547,"ေမွ်ာ္":753550,"မွ်ို့":753577,"မွ်င္":754000,"မွ်စ္":754100,"မွ်ဥ္း":754413,"ျမွူ":757022,"ေျမွး":757033,"ေျမွာက္":757145,"ျမွိုက္":757175,"ျမွင့္":757502,"ေျမွာင္":757545,"ေျမွာင့္":757547,"ေျမွာင္း":757548,"ျမွပ္":759100,"ျမွုပ္":759120,"ျမွံုး":759584,"ေမွြ":760530,"ေမွြ့":760532,"ေမွြး":760533,"မွြတ္":762100,"မွြန္":762500,"မွြန္း":762503,"မွြာ":760510,"မွြင္း":761003,"ယ":780000,"ယာ":780010,"ယား":780013,"ယီး":780020,"ယု":780020,"ယူ":780022,"ယူး":780025,"ေယ":780030,"ယဲ့":780042,"ေယာ":780045,"ယံ":780060,"ယို":780075,"ယို့":780077,"ယိုး":780078,"ယက္":780100,"ေယာက္":780145,"ယုဂ္":780320,"ယင္":780500,"ယင္း":780503,"ေယာင္":780545,"ေယာင္း":780548,"ယိုင္":780575,"ယစ္":780600,"ယဇ္":780800,"ယဥ္":780910,"ယဥ့္":780912,"ယဥ္း":780913,"ယာဥ္":780920,"ယတ္":781600,"ယုတ္":781620,"ယန္":782000,"ယန္း":782003,"ယုန္":782020,"ယပ္":782100,"ယမ္း":782503,"ယိမ္း":782518,"ယံု":782581,"ယံု့":782583,"ယြံ":790560,"ယြက္":790600,"ယြင္း":791003,"ယြတ္":792100,"ယြန္း":792503,"ယွက္":780100,"ယွဥ္":780910,"ရ":810000,"ရာ":810010,"ရိ":810015,"ရီ":810017,"ရူ":810022,"ရူး":810025,"ေရ":810030,"ေရး":810033,"ရဲ":810040,"ေရာ":810045,"ေရာ့":810047,"ေရာ္":810050,"ရံ":810060,"ရို":810075,"ရို့":810077,"ရိုး":810078,"ရံုး":812584,"ရက္":810100,"ရိက္":810115,"ရုက္":810120,"ေရာက္":810145,"ရိုက္":810175,"ရင္":810500,"ရင့္":810502,"ရင္း":810503,"ေရာင္":810545,"ေရာင့္":810547,"ေရာင္း":810548,"ရိုင္":810575,"ရိုင္း":810578,"ရစ္":810600,"ရဥ့္":810912,"ရည္":811000,"ရည္း":811003,"ရတ္":811600,"ရိတ္":811615,"ရုတ္":811620,"ရန္":812000,"ရန္း":812003,"ရုန့္":812022,"ရုန္း":812023,"ရပ္":812100,"ရိပ္":812115,"ရုပ္":812120,"ရမ္":812500,"ရမ္း":812503,"ရံု":812581,"ရယ္":812600,"ရသ္":813000,"ရြ":820500,"ရြာ":820510,"ရြား":820513,"ေရြ":820530,"ေရြ့":820532,"၍":820533,"ေရြး":820533,"ရြဲ":820540,"ရြဲ့":820542,"ရြံ":820560,"ရြံ့":820562,"ရြက္":820600,"ရြတ္":822100,"ရြပ္":822600,"ရြမ္း":823003,"ရြယ္":823100,"ရွ":810000,"ရွာ":810010,"ရွား":810013,"ရွိ":810015,"ရွု":810020,"ရွူ":810022,"ရွူး":810025,"ေရွ့":810032,"ေရွး":810033,"ရွဲ":810040,"ေရွာ":810045,"ရွံ":810060,"ရွက္":810100,"ေရွာက္":810145,"ရွင္":810500,"ရွင္း":810503,"ေရွာင္":810545,"ရွစ္":810600,"ရွဥ့္":810912,"ရွဥ္း":810913,"ရွည္":811000,"ရွုတ္":811620,"ရွိန္":812015,"ရွိန္း":812018,"ရွုန္း":812023,"ရွပ္":812100,"ရွုပ္":812120,"ရွမ္း":812503,"ေရွြ":820530,"ေရွြ့":820532,"ရွြံ့":820562,"ရွြင္":821000,"ရွြန္း":822503,"ရွြပ္":822600,"ရွြမ္း":823003,"လ":840000,"လီ":840017,"လု":840020,"လူ":840022,"လူး":840025,"ေလ":840030,"ေလ့":840032,"ေလး":840033,"လဲ":840040,"ေလာ":840045,"ေလာ့":840047,"ေလာ္":840050,"လံ":840060,"လို":840075,"လက္":840100,"ေလာက္":840145,"လိုက္":840175,"လင္":840500,"လင္း":840503,"လိင္":840515,"ေလာင္":840545,"ေလာင္း":840548,"လိုင္":840575,"လစ္":840600,"လည္":841000,"လည္း":841003,"လိုဏ္":841575,"လတ္":841600,"လိတ္":841615,"လုတ္":841620,"လန္":842000,"လန့္":842002,"လန္း":842003,"လိန္း":842018,"လိမ္း":842518,"လပ္":842100,"လိပ္":842115,"လုပ္":842120,"လာဘ္":842410,"လမ္း":842503,"လိမ္":842515,"လိမ့္":842517,"လံု":842581,"လံု့":842583,"လံုး":842584,"လယ္":842600,"လ်ာ":843510,"ေလ်ာ့":843547,"ေလ်ာ္":843550,"လ်က္":843600,"ေလ်ာက္":843645,"လ်င္":844000,"ေလ်ာင္း":844048,"လ်စ္":844100,"လ်ဥ္":844410,"လ်ဥ္း":844413,"လ်ပ္":845600,"ေလြ့":850532,"လြဲ":850540,"လြင္":851000,"လြင့္":851002,"လြတ္":852100,"လြန္":852500,"လြန္း":852503,"လြမ္း":853003,"လြယ္":853100,"လွီ":840017,"လွီး":840020,"လွူ":840022,"ေလွ":840030,"လွဲ":840040,"ေလွာ္":840050,"လွံ":840060,"ေလွာက္":840145,"လိ":840015,"လွင္":840500,"ေလွာင္":840545,"လွစ္":840600,"လွည့္":841002,"လွည္း":841003,"လွန္":842000,"လွန့္":842002,"လွန္း":842003,"လွပ္":842100,"လွုပ္":842120,"လွမ္း":842503,"လွိမ့္":842517,"လွ်ာ":843510,"ေလွ်ာ":843545,"ေလွ်ာ့":843547,"ေလွ်ာ္":843550,"လွ်ံ":843560,"လွ်ို":843575,"လွ်ို့":843577,"လွ်ိုး":843578,"ေလွ်ာက္":843645,"လွ်င္":844000,"လွ်ပ္":845600,"လွ်မ္း":846003,"လွြ":850500,"လွြာ":850510,"လွြား":850513,"လွြဲ":850540,"လွြံ့":850562,"လွြင့္":851002,"လွြတ္":852100,"လွြမ္း":853003,"ဝ":870000,"ဝာ":870010,"ဝား":870013,"ဝိ":870015,"ဝီ":870017,"ေဝ":870030,"ေဝ့":870032,"ေဝး":870033,"ဝဲ":870040,"ဝံ":870060,"ဝံ့":870062,"ဝက္":870100,"ဝိုက္":870175,"ဝဂ္":870300,"ဝင္":870500,"ဝင့္":870502,"ဝင္း":870503,"ဝိုင္း":870578,"ဝစ္":870600,"ဝိဇ္":870815,"ဝဋ္":871100,"ဝတ္":871600,"ဝန္":872000,"ဝန္း":872003,"ဝုန္း":872023,"ဝပ္":872100,"ဝမ္း":872503,"ဝယ္":872600,"ဝသ္":873000,"ေဝသ္":873030,"ေဝွ့":870032,"ေဝွး":870033,"ဝွဲ":870040,"ဝွန္":872000,"ဝွန္း":872003,"ဝွမ္း":872503,"သ":900000,"သာ":900010,"သား":900013,"သိ":900015,"သီ":900017,"သီး":900020,"သု":900020,"သူ":900022,"သူ့":900024,"ေသ":900030,"ေသး":900033,"သဲ":900040,"သဲ့":900042,"ေသာ":900045,"ေသာ့":900047,"ေသာ္":900050,"သံ":900060,"သံ့":900062,"သို":900075,"သို့":900077,"သိုး":900078,"သက္":900100,"သိက္":900115,"သုက္":900120,"ေသာက္":900145,"သိုက္":900175,"သင္":900500,"သင့္":900502,"သင္း":900503,"သိင္":900515,"ေသာင္":900545,"ေသာင္း":900548,"သိုင္း":900578,"သစ္":900600,"သဥ္":900910,"သိဥ္":900925,"သုဥ္း":900933,"ေသဥ္":900940,"သည္":901000,"သည္း":901003,"ေသဋ္":901130,"သဏ္":901500,"သတ္":901600,"သုတ္":901620,"ေသတ္":901630,"သဒ္":901800,"သိဒ္":901815,"သုဒ္":901820,"သန္":902000,"သန့္":902002,"သန္း":902003,"သိန္":902015,"သိန္း":902018,"သုန္":902020,"သပ္":902100,"သိပ္":902115,"သုပ္":902120,"ေသာပ္":902145,"သဗ္":902300,"သမ္":902500,"သမ္း":902503,"သိမ္":902515,"သိမ့္":902517,"သိမ္း":902518,"သံု့":902583,"သံုး":902584,"သယ္":902600,"သိဟ္":903115,"သြာ":910510,"သြား":910513,"ေသြ":910530,"ေသြ့":910532,"ေသြး":910533,"သြံ":910560,"သြက္":910600,"သြတ္":912100,"သြန္":912500,"သြန္း":912503,"သြပ္":912600,"သွ်ား":903513,"သွ်ိ":903515,"သွ်ို":903575,"သွ်ိုး":903578,"ေသွ်ာင္":904045,"သွ်တ္":905100,"ဟ":930000,"ဟာ":930010,"ဟိ":930015,"ဟီ":930017,"ဟီး":930020,"ေဟ":930030,"ဟဲ":930040,"ေဟာ":930045,"ေဟာ့":930047,"ဟံ":930060,"ဟို":930075,"ဟိုး":930078,"ဟက္":930100,"ဟင္း":930503,"ေဟာင္":930545,"ေဟာင္း":930548,"ဟိုင္း":930578,"ဟစ္":930600,"ဟည္း":931003,"ဟိတ္":931615,"ဟုတ္":931620,"ဟန္":932000,"ဟန့္":932002,"ဟိန္း":932018,"ဟုန္":932020,"ဟုန္း":932023,"ဟပ္":932100,"ဟုပ္":932120,"ဟံု":932581,"ဟံုး":932584,"ဟသ္":933000,"ဠ":960000,"အ":990000,"အာ":990010,"အား":990013,"အူ":990022,"ေအး":990033,"အဲ":990040,"ေအာ့":990047,"အံ":990060,"အံ့":990062,"အို":990075,"အိုး":990078,"အက္":990100,"ဥက္":990121,"ေအာက္":990145,"အိုက္":990175,"အဂ္":990300,"အင္":990500,"အင့္":990502,"အင္း":990503,"ေအာင္":990545,"ေအာင့္":990547,"အိုင္":990575,"အစ္":990600,"ဣ":990016,"ဥစ္":990621,"ဧည့္":991033,"အဋ္":991100,"ဣဋ္":991116,"ဥဏ္":991521,"အတ္":991600,"ဣဒ္":991816,"အန္":992000,"အန္း":992003,"ဣန္":992016,"အုန္":992020,"အုန္း":992023,"အပ္":992100,"အိပ္":992115,"အဗ္":992300,"အမ္း":992503,"အိမ္":992515,"အိမ့္":992517,"အိမ္း":992518,"ဥမ္":992521,"အံု့":992583,"အံုး":992584,"အသ္":993000,"ဣသ္":993016,"ဥသ္":993021,"ရား":810013,"လာ":840010,"ေစာ့":180047,"လ်ား":843513,"ဆုန္":212020,"ညြတ္":312100,"ဏန္း":452003,"ေတာ့":480047,"တိုက္":480175,"ဒတ္":541600,"လ်":843500,"ခ်ိ":63515,"ဗြီး":700520,"ရု":810020,"ယီ":780017,"ကဋ္":31100,"ဝိက္":870115,"ဏာ":450010,"ျသ":907000,"ရိုဏ္":811575,"ရိုဏ္း":811578,"ရိန္း":812018,"လဲ့":840042,"တြင္း":491003,"လား":840013,"ပ်င္":634000,"လာပ္":842110,"လ်ည္း":844503,"သိုဏ္း":901578,"ဗြန္":702500,"ဓိ":570015,"ယိ":780015,"ဏူ":450022,"ျဒာ":547010,"အုတ္":991620,"သိုလ္":902875,"ရဲ့":810042,"ျဂ":97000,"ဝွက္":870100,"ရာဇ္":810810,"ေဏ":450030,"လိုး":840078,"ကုစ္":30620,"ဝိစ္":870615,"နူ":600022,"သည့္":901002,"အိတ္":991615,"ေအာင္း":990548,"ရီး":810020,"ဌီ":360017,"ေလြ":850530,"ဂံုး":92584,"ဇိဒ္":241815,"မဋ္":751100,"ဌာန္း":362013,"ဏီ":450017,"လွယ္":842600,"အုပ္":992120,"နွင့္":600502,"စယ္":182600,"ဒာန္း":542013,"ဇူး":240025,"ေကး":30033,"မိုရ္":752775,"နု္ပ္":602120,"ငွန္း":152003,"ငင္":150500,"လွ":840000,"ေမာ့":750047,"ဆစ္":210600,"ပမ္း":632503,"ပိုင့္":630577,"ေဗး":690033,"နဲ":600040,"ေနာင္း":600548,"နွြဲ":610540,"မ်ာ":753510,"ယာန္":782010,"အံု":992581,"ေနာင့္":600547,"ဇဥ္":240910,"ဗ်ား":693513,"ျပည္း":638003,"ျဖင့္":667502,"သြင္း":911003,"ဟတ္":931600,"ငဲ့":150042,"ငင့္":150502,"ေသ့":900032,"ေသာင့္":900547,"မွြ":760500,"ယ်ာဥ္":784420,"ေဟာက္":930145,"လည္":841000,"နံုး":602584,"ေလွး":840033,"ဠုန္":962020,"ဝုတ္":871620,"မွာန္":752010,"ဂိုလ္":92875,"ဝိန္":872015,"ဓဗ္":572300,"ျတီ":487017,"ဒို":540075,"ဂ်က္":93600,"က်ီံ":33577,"ခြား":70513,"ေပ်ာ":633545,"ရံ့":810062,"ဝု":870020,"ဏား":450013,"ဖန္း":662003,"သြယ္":913100,"ရြင္း":821003,"ပာတ္":631610,"ေငြ့":160532,"ျငင္":157500,"ဆိမ္":212515,"စြင့္":191002,"သြမ္း":913003,"ဠာ":960010,"ခြန့္":72502,"ဆြံ":220560,"ဂံ":90060,"ခ်ဥ့္":64412,"လဒ္":841800,"ျတ":487000,"ေတ့":480032,"ဏိ":450015,"ရိမ္":812515,"ဝာက္":870110,"သာဒ္":901810,"ဍာ":390010,"ဍီ":390017,"တာန္":482010,"ရန့္":812002,"ခဏ္":61500,"လြံ":850560,"နြင္း":611003,"ရွယ္":812600,"နွြယ္":613100,"ငံ့":150062,"ေဆာ့":210047,"ဆြန္း":222503,"သၤ":900000,"အီ":990017,"ေမာင္":750545,"ေယာ္":780050,"နည္":601000,"ဇိုး":240078,"ယ်":783500,"ဗု":690020,"ဒိပ္":542115,"ေညာ":300045,"ညုန္း":302023,"က်ု":33520,"ညူး":300025,"ညမ္း":302503,"ထည္း":511003,"ညူ":300022,"တြား":490513,"အယ္":992600,"ေအာ္":990050,"ကြ":40500,"ေငး":150033,"ေထ":510030,"ဟာန္":932010,"ေနြ":610530,"ပည့္":631002,"ဖ်င့္":664002,"ရွည့္":811002,"ဟား":930013,"ဟြပ္":942600,"ေနြး":610533,"ဏွိ":450015,"စြ":190500,"တြာ":490510,"ျမြာ":767510,"ဏုပ္":452120,"ငူ":150022,"ပံ":630060,"က်ံ့":33562,"မွင္":750500,"ဆင့္":210502,"ေတြ":490530,"ဘယ့္":722602,"ဋုက္":330120,"ပည္":631000,"အိုင္း":990578,"ဇိုင္း":240578,"ေဒး":540033,"ဓံ":570060,"ဟု":930020,"ခိ":60015,"ဒင္း":540503,"ဟန္း":932003,"ဂုဏ္း":91523,"ဍား":390013,"နြန္":612500,"ဓိဋ္":571115,"ရာယ္":812610,"ဂို":90075,"ဂိုရ္":92775,"ဍုက္":390120,"ကာယ္":32610,"ေျဂာ":97045,"ျကင့္":37502,"မ်စ္":754100,"ရိန္":812015,"နွဲ့":600042,"ခဲ့":60042,"ဓမ္း":572503,"ဌိ":360015,"ဗာန္":692010,"လီး":840020,"ရြန္":822500,"လို့":840077,"နွန္း":602003,"လ်င္း":844003,"လိန္":842015,"ဃာတ္":121610,"ညာဥ္":300920,"ဘာန္":722010,"ဋိစ္":330615,"မုပ္":752120,"ဒုမ္":542520,"ဏု":450020,"ဝဏ္":871500,"ဝုဏ္":871520,"ယာယ္":782610,"ဝုစ္":870620,"နမ္":602500,"သွ်ူး":903525,"ဠိ":960015,"ဟိုရ္":932775,"မို့":750077,"အို့":990077,"ဆိန္":212015,"အိုင့္":990577,"ရွိမ္း":812518,"ယ်ာ":783510,"ယယ္":782600,"ရွြတ္":822100,"စုဒ္":181820,"ေဓ":570030,"ဍု":390020,"ဍိတ္":391615,"ေဏး":450033,"ပိုဏ္":631575,"ဓာန္":572010,"တဥ္း":480913,"သုန္း":902023,"အိ":990015,"ေညွာင္":300545,"သွ်ု":903520,"အဲ့":990042,"ငွာ":150010,"မိုင္":750575,"ပ်ူး":633525,"ရုဏ္":811520,"ျပိ":637015,"သာဠ္":903210,"ေအ":990030,"သွ်":903500,"ဌာဗ္":362310,"ျခည္း":68003,"နွည္":601000,"ပြာ":640510,"ဂ်ီး":93520,"ရွြဲ":820540,"ဟူး":930025,"ဓတ္":571600,"ေအာ":990045,"ရုဏ္း":811523,"ေဟာ္":930050,"ျဗင္း":697503,"စိုရ္":182775,"ဒိုလ္":542875,"ဇြာ":250510,"ထြင္း":521003,"ဘ်မ္း":726003,"ပဒ္":631800,"ဂ်ို":93575,"လူ့":840024,"ကိုဋ္":31175,"ခို့":60077,"ဓီ":570017,"နိုင့္":600577,"နုသ္":603020,"ဒာန္":542010,"ဝုန္":872020,"ေထး":510033,"ျတာ":487010,"ဖ်ူး":663525,"ဒိမ္း":542518,"ထုန္":512020,"ရဥ္း":810913,"ဂင္":90500,"ေဌာ":360045,"ဍိုင္":390575,"ဍပ္":392100,"သံု":902581,"ေနွာက္":600145,"ေရွ":810030,"စြမ္":193000,"ျမံ":757060,"လိဋ္":841115,"နြန္း":612503,"လွ်င္း":844003,"မွြား":760513,"လမ္":842500,"ပာယ္":632610,"လင့္":840502,"ဓိုရ္":572775,"သြင္":911000,"တဏ္":481500,"ေလ်ာ":843545,"တြံ့":490562,"တြ":490500,"နိက္":600115,"ရွန့္":812002,"ရွြာ":820510,"နွုမ္း":602523,"ညြန့္":312502,"ဝွန့္":872002,"လြန့္":852502,"ဆြ":220500,"ဣတ္":991616,"ပုလ္":632820,"တြဒ္":492300,"လ်ူ":843522,"ခွြ်တ္":75600,"ေလွာ":840045,"ဇိန္":242015,"ဏိဇ္":450815,"ပာက္":630110,"ပသ္":633000,"သဇ္":900800,"ဂာမ္":92510,"မုစ္":750620,"မုဒ္":751820,"မာသ္":753010,"ရဇ္":810800,"ဈာယ္":272610,"ဓု":570020,"သွ်ံ":903560,"သာန္":902010,"ခိပ္":62115,"ျဂု":97020,"ဂုတ္":91620,"ေဓာ":570045,"ပုသ္":633020,"ျသတ္":908600,"နက္မ္":600100,"ျကုပ္":39120,"ေငာ္":150050,"ေညွာက္":300145,"လုန္":842020,"ဓိပ္":572115,"ဓြန့္":582502,"တဂ္":480300,"ဂတ္":91600,"ျဖိုက္":667175,"ျမု":757020,"ျမိုင့္":757577,"မွြမ္း":763003,"လဇ္":840800,"ေလြး":850533,"လိသ္":843015,"နွက္":600100,"ဟမ္း":932503,"ခ်ာတ္":65110,"ဃာ":120010,"ထဗ္":512300,"ဝဇ္":870800,"ဇန္း":242003,"ဠွီ":960017,"တိုရ္":482775,"အည္း":991003,"ဥ":990021,"ဥံု":992582};

function _gv(_s){
	if(_cachegv[_s]) return _cachegv[_s];
	var ret=0;
	for (var i1=0;i1<sorting.val.length;i1++){ 
		eval('re = /' + sorting.val[i1] + '/' ); 
		if(re.test(_s)){ 
			var result =re.exec(_s); 
			ret += eval(sorting.attr[i1]); 
		} 
	}
	if(ret!=0)_cachegv[_s]=ret;
	return ret;
}

;var sorting={
			val:["([က-အ])(?![္ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅ])","ႏ","ာ","[ိ]","ီ","[ုဳ]","[ူဴ]","း","ေ","ေ.*ာ","[့႔႕]","ဲ","ေ.*ာ္","ံ","ိ.*ု","ံ.*ု","([က-အ])္","[က-အႏ]([ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅ])","[်ၽ]","[ၾႂႀႄျၿႁႃ]","ြ","ဥ္","ဣ","[ဥ](?![္])","ဧ","ဩ","ဪ","ဤ","ဦ","ဥ.*ု","၌","၍"]
			, attr:["(bord(result[1])+1)*30000","20*30000","10","15","17","20","22","3","30","5","2","40","5","60","40","2501","(bord(result[1])+1)*100","(bord(result[1])-32)*30000+1","3500","7000","10500","910","990016","990021","990031","990046","990051","990018","990023","-20","600176","820533"]
			, exv:["([က-အႏ])[ၠၡၢၣၥၧၨၩၬၭၰၲၱၳၵၶၷၸၹၺၻၼႅ]"]
			, exa:["(bord(result[1],\"Zawgyi_One\")+1)*1000"]
		};
	
;var _cache=new Object();

;String.prototype.bsort=function(_method){
	var ret = this.split("\n");
	return ret.sort(_method);
};

function bSort2(str1,str2){ 
	var ret =0;
	var a=str1.ctrim().split("\u200B");
	var b=str2.ctrim().split("\u200B");
	var _len = a.length>b.length?b.length:a.length;
	for(var i1=0;i1<_len;i1++){
		if(a[i1]!=b[i1]){
			var _aval=_gv(a[i1]);
			var _bval=_gv(b[i1]);
			ret = (_aval==0 ? 10000000 : _aval) - (_bval==0 ? 10000000 : _bval);
			if(trim(a[i1])=="" || trim(b[i1])=="") {
				ret = a[i1] < b[i1];
			}
			break;
		}else if(i1==_len-1 && a.length<b.length){
			ret = 1;
		}
	}
	return ret; 
}

function bArray(str){
	var ret =str.bac().cab().bnormalize().bsplit().join("\u200B");
	for( var i = 0 ; i < ret.length; i++){
		ret[i] = ret[i].ctrim();
	}
	return ret;
}
;String.prototype.bArray = function(){
	return bArray(this);
};
*/



// Reverse Regular Expression Pattern Generator ==
// # Support [] ? for now #
// # [] may appear twice #

/* Temporary disabled Burglizer */
/*
var _bc = [];var _bcx={};var _bcb={};
function b2bc(){
    var _c=[]; //cache for sort a - z
    //all consonents
    for(var k=0; k<_b.c.length; k++){
        for(var idx in _b.c[k]){
            _c[_c.length] = [ idx, _b.c[k][idx] ];
        }
    };
    //special chars
    for(var k=0; k<_b.s.length; k++){
        _bc[_bc.length] = _b.s[k];
        if(_bcb[ _b.s[k][1] ]){
        	_bcb[ _b.s[k][1] ][ _bcb[ _b.s[k][1] ].length ] = _b.s[k][0];
        }else{
        	_bcb[ _b.s[k][1] ]=[ _b.s[k][0] ];
        }
    };
    //_c.sort();
   for(var k=0; k<_c.length; k++){
            var i = _b.v.length-1;
            while (i>=0) {
                for( var _x in _b.v[i].r ){
                    for( var i1=0; i1 < _c[k][1].length; i1++){
                        for(var n=0; n<_b.v[i].r[_x].length; n++){
                            var _r1 = (_c[k][0]=="a"?"":_c[k][0])+_x; //romanji
                            var _w = _b.v[i].r[_x][n].replace("$1",_c[k][1][i1]); //burmese
                            //if [] in the re
                            if( /\[[^\[\]]*\]/.test(_r1) ){
                                var _m1 = _r1.match(/\[[^\[\]]*\]/g);
                                //only one []
                                if(_m1.length==1){
                                    var _m2 = _m1[0].match(/\w/g);
                                    for (var i2=0; i2<_m2.length ; i2++){
                                        var _r2 = _r1.replace(_m1[0],_m2[i2]);
                                        _bc[_bc.length] = [ _r2, _w, "", ""];
                                        if(_bcb[_w]){
                                        	_bcb[_w][ _bcb[_w].length ] = _r2;
                                        }else{
                                        	_bcb[_w]=[_r2];
                                        }
                                    }
                                }else if(_m1.length==2){
                                    var _m2 = _m1[0].match(/\w/g);
                                    var _m3 = _m1[1].match(/\w/g);
                                    for (var i2=0; i2<_m2.length ; i2++){
                                        for (var i3=0; i3<_m3.length ; i3++){
                                            var _r2 = _r1.replace(_m1[0],_m2[i2]);
                                            _r2 = _r2.replace(_m1[1],_m3[i3]);
                                            _bc[_bc.length] = [ _r2, _w, "", ""];
                                            if(_bcb[_w]){
	                                        	_bcb[_w][ _bcb[_w].length ] = _r2;
	                                        }else{
	                                        	_bcb[_w]=[_r2];
	                                        }
                                        }
                                    }
                                }
                            }else{
                                if( /(\?)/.test(_r1) ){
                                    var _m1 = _r1.match(/(\w)(\?)/);
                                    var _r2 = _r1.replace(_m1[0], "");
                                    _bc[_bc.length] = [ _r2, _w, "", ""];
                                    _r2 = _r1.replace(_m1[0],_m1[1]);
                                    _bc[_bc.length] = [ _r2, _w, "", ""];
                                }else{
					                _bc[_bc.length] = [ _r1, _w, "", ""];
					                if(!_bcx[_r1.charAt(0)]) _bcx[_r1.charAt(0)] = _bc.length;
					                if(_bcb[_w]){
                                    	_bcb[_w][ _bcb[_w].length ] = _r1;
                                    }else{
                                    	_bcb[_w]=[_r1];
                                    }
					            }
					        }
                        }
                    }
                }
             i--;
            }
        }
};

//Burmese to Burglish routine
String.prototype.burglize =function(){
	var ret ="";
	var _s = this.bsplit();
	for(var i=0;i<_s.length; i++){
		if(_bcb[_s[i]]) { 
			ret+=_bcb[_s[i]][0];
		}else{
			ret +=_s[i];
		}
		var _n1 = _s[i<_s.length-1?i+1:i];
		var re = /[\n\s]/;
		ret += (re.test(_s[i]) || re.test(_n1) )?"":" ";
	}
	return ret;
};
*/